# IsPaletteExcluded Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..IsPaletteExcluded Method
FabricationService Class See Also
---
Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsPaletteExcluded(
	int paletteIndex
)
```

Visual Basic
---
```text
Public Function IsPaletteExcluded ( _
	paletteIndex As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool IsPaletteExcluded(
	int paletteIndex
)
```

# ### Parameters
paletteIndex
    Type: System..::..Int32 The index of the palete.
# ### Return Value
Returns true if the palette indexed by paletteIndex is currently to be excluded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index paletteIndex is not larger or equal to 0 and less than PaletteCount. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace